{
    "address": "33, Coomunity Road, Off LASU-Isheri Road, Obadore, Lagos State.",
    "churchAnthem": "Divine Christian Assembly, <br> The loving caring church, <br> We teach, and we uphold, <br> The doctrines of God Most High, <br> We live to proclaim the gospel news, <br> Everywhere man could be found, <br> We live daily by faith and of love, <br> Showing the beauty of Christ, <br> We must rise up to the calling of our, <br> Master and our God, <br> He's our Saviour, Healer, Baptiser, <br> He's our glorious reigning King.",
    "closingAnthem": "I love this family of God, <br> And I am, so blessed to be a part of it, <br> This is where, the love of Jesus reigns, <br> I love you and you love me, <br> So let us pray <br> May the grace of God, <br> Be with all of us <br> So that the next time we meet, it’ll be to celebrate <br> The faithfulness of God.",
    "branches": [
        "Plot 2, Rd 1, Opp Beccy Joe school, Pure water, B/stop, Bagadry Exp. Way, Magbon, Lagos Nigeria",
        "9, Arufa Street, Agric Bustop, Ojo, Lagos Nigeria",
        "Lasu Arena, Behind Success star school, oguntedo, Ogun State Lagos, Nigeria",
        "Oluwaseun street, Off savi, Agric road, Ikoga, Lagos Nigeria",
        "Safiu Aduke Close, carpenter B/stop, off Bagadry Express way, Ajangbadi, Lagos."
    ],
    "description": "DCA was established on January 11th, 1987 by Rev and Rev. Mrs. E.O Folarin. The Head quarter is located at 33/37 Community Road, Obadore, Lagos, Nigeria.",
    "mission": "Preparing the bride of Christ in a holy and acceptable manner as pre-purposed by God, reaching the unreached through mission.​",
    "missionStations": [
        "Mozum, Odugbo road",
        "Oguma, Ogba Road",
        "Ketechi, along Ujoh Oguma Road",
        "Edikeyi",
        "Olengelegi, along Lokoja River"
    ],
    "name": "Divine Christian Assembly",
    "values": "We believe that the Bible is God’s Word. It is accurate, authoritative and applicable to our everyday life.",
    "vision": "A place where a person with no church background can come and feel comfortable and enjoy God’s presence."
}