[
    {
        "position": "General Superintendent",
        "title": "Rev. Dr.",
        "name": "Emmanuel Olubayo Folarin",
        "url": "../assets/images/founders1.png",
        "biography": {
            "description": "Rev. Dr Emmanuel Olubayo Folarin was born on August 31st 1947. I was born to an Anglican home of Mr. and Mrs. James A. Folarin. He was a farmer and his wife a trader. <br> I was brought up by strict parents who believed in God and high value standards. There were seven children and five of them were called by God into the Pastoral ministry. Three of them became General Overseers of different denominations.",
            "ministry": "I was a member of Scripture union of Nigeria; I was ordained a local preacher by Rev. Allan Wash brook in 1973. I was ordained a pastor and pastored Christ Followers Mission headquarters for some years. <br> I attended Faith Theological Seminary and I have a Ph.d in Christian education (Ph.d, c.ed) and Theological doctorate.",
            "marriage": "I married Rev. Felicia Eyitope Okitika on December 24th 1977. <br> Rev. F.E Folarin was born on September 10th to Mr. & Mrs. Akeju Okitika at ishua Akoko. She has a B.ed. Masters in Educational Management and Theological doctorate. She was a high school principal and was ordained into the Ministry 1987.",
            "children": "Rev and Mrs. Folarin are blessed with four boys <br> Mrs. Olubukola Idehen <br> Rev. Ademola Oluwatosin Folarin (BSc Chemistry and MBA) <br> Mr. Abimbola Olukunle Folarin <br> Mr. Mobolaji Folarin (BSc Biochemistry) <br> Rev. Olubusayo Folarin (BSc, MBA)"
        }
    },
    {
        "position": "Senior Pastor",
        "title": "Rev. Dr. Mrs.",
        "name": "Emmanuel Olubayo Folarin",
        "url": "../assets/images/founders2.png",
        "biography": {
            "description": "I am Rev. Mrs Felicia Eyitope Folarin. I am married to Rev Dr E.O Folarin, the founder of Divine Christian Assembly . A retired civil servant. Born to a Catholic parents,late pa Jerome Okitika and mama Rhodah Olufunke Okitika who is alive. . A native of Isua Akoko ,in Akoko south East in Ondo State of Nigeria. Born on the 10th of September ,1957. Qualifications include; BA.Ed, M.ed and Theological doctorate. A mother of four .Retired Secondary school principal. Has supported her husband in the work of the ministry,since the inception of Divine Christian Assembly in 1986. She had salvation experience at a tender age in New Bussa ,Kainji. She had her early Christian raising with the Scripture Union. She remains a child of God till date."
        }
    }
]