{
  "Rev. Dr. Emmanuel Olubayo Folarin": "Rev. Dr Emmanuel Olubayo Folarin was born on August 31st 1947. I was born to an Anglican home of Mr. and Mrs. James A. Folarin. He was a farmer and his wife a trader. I was brought up by strict parents who believed in God and high value standards. There were seven children and five of them were called by God into the Pastoral ministry. Three of them became General Overseers of different denominations.\n\nMINISTRY\nI was a member of Scripture union of Nigeria; I was ordained a local preacher by Rev. Allan Wash brook in 1973. I was ordained a pastor and pastored Christ Followers Mission headquarters for some years. I attended Faith Theological Seminary and I have a Ph.d in Christian education (Ph.d, c.ed) and Theological doctorate.\n\nMARRIAGE\nI married Rev. Felicia Eyitope Okitika on December 24th 1977. Rev. F.E Folarin was born on September 10th to Mr. & Mrs. Akeju Okitika at ishua Akoko. She has a B.ed. Masters in Educational Management and Theological doctorate. She was a high school principal and was ordained into the Ministry 1987.\n\nCHILDREN\nRev and Mrs. Folarin are blessed with four boys; Mrs. Olubukola Idehen, Rev. Ademola Oluwatosin Folarin (BSc Chemistry and MBA), Mr. Abimbola Olukunle Folarin, Mr. Mobolaji Folarin (BSc Biochemistry), Rev. Olubusayo Folarin (BSc, MBA)",
  "Rev. Dr. Mrs. Felicia Eyitope Folarin": "I am Rev. Mrs Felicia Eyitope Folarin. I am married to Rev Dr E.O Folarin, the founder of Divine Christian Assembly . A retired civil servant. Born to a Catholic parents,late pa Jerome Okitika and mama Rhodah Olufunke Okitika who is alive. . A native of Isua Akoko ,in Akoko south East in Ondo State of Nigeria. Born on the 10th of September ,1957. Qualifications include; BA.Ed, M.ed and Theological doctorate. A mother of four .Retired Secondary school principal. Has supported her husband in the work of the ministry,since the inception of Divine Christian Assembly in 1986. She had salvation experience at a tender age in New Bussa ,Kainji. She had her early Christian raising with the Scripture Union. She remains a child of God till date.",
  "Rev. Dr. Olubusayo Folarin": "Olubusayo Folarin was born on April 21st to Rev.Dr. & Rev. Dr. Mrs E.O Folarin. I studied Economics in my First degree and bagged a 1st class from Babcock University to the glory of God. I also have masters degree in Marketing from LASU. I have worked as a customer care professional, Marketing communications expert for many years and also been a consultant in some business capacity. I will say I have always been in ministry as I was born to parents who were in the vineyard of the Lord. I was formally ordained into the pastoral office on April 21st, 2019 and I currently pastor the head quarter church of this great ministry under the leadership of my father in the Lord Rev. Dr. E.O Folarin",
  "Deacon Ekule P.O Barry": "My name is Deac Ekule P.O Barry, I was born on the 18th of April. I hail from Obiaruku in ukwuani LGA of Delta state. Am a Building contractor and specialized in interior and exterior decoration (POP). Married with two children. I joined DCA ikoga branch December 16, 2012. Served in the Ushering and technical dept, later became the church secretary and member of the building committee. I was ordained as a Deacon in April 2017. In June 2018 I became the pastor in charge of Ikoga branch till date",
  "Samuel Bamidele Adebayo": "I am reverend Samuel Bamidele Adebayo, a native of Edo State, formerly Bendel State. My pastorial experience started in the year 1986 with Gospel Faith Mission International, Ojo, Ibandan, where I served as the resident pastor and planted several branches of the ministry in Ibadan and Lagos districts. I attended Gospel Bible College and Seminiary Ibandan campus where I  obtained a higher diploma in Theology and bachelor of art in christian educationfrom 1978-1982.",
  "Uyakemegbia Funfade Temitope": "I am Uyakemegbia Funfade Temitope a graduate of Business Administration from Lagos State University. I joined DCA as a youth in 2014 as a pianist and grew in ranks to the post of the Music Director. I currently occupy the administrative office in charge of Operations of the ministry. I'm married to Maureen Funfade, and we are blessed with 2 lovely daughters.",
  "Deacon Oluwatobi Akapo": "I am Deacon. Oluwatobi Akapo, born on June 3rd to Rev. E.G and Evangelist Mrs G.O Akapo. I Studied Cell Biology and Genetics from the University of Lagos. I have worked in the Customer Experience profession and currently in the Sales Profession. I was given birth to in Divine Christian Assembly and gave my life to Christ April 30th 2000 with the topic being the Great White Throne Judgement preached by my Daddy in the Lord the founder of Divine Christian Assembly Rev. Dr. E.O Folarin. I am currently in the Deaconate office and hold the Administrative Office; Ministerial Services.",
  "Aranmonise Okeoghene Faith": "Aranmonise Okeoghene Faith, a graduate of Banking and Finance(Bsc) and a Masters degree holder in Human Resource and Industrial Relations from Lagos State University. I am a seasoned Admistrator with over 10 years experience in caring out Administrative duties . I am also a member of Chartered Institute of Public Management of Nigeria. I joined DCA in 1997 and In 1999 i joined the choir department as a teenager and I am serving in that department till date. A valued member of the marriage counselling committee . I am currently the Admin finance and I oversee the ministry's Kingdom partners and other Finance related matters. I am married to Aranmonise David and we are blessed with three wonderful children.",
  "Rev. Matthew Abraham": "I am pastor Matthew Abraham, a trained and professional teacher/educational administrator. I have been a pastor with DCA for 15 years. I joined DCA as a member in the year 1998. I have pastored 2 branches and I am currently the pastor of DCA Mission Hqt Mozum.",
  "Rev. Luke Wodi": "I am pastor Luke Wodi, a trained computer and printer mantainance. I joined Divine Christian Assembly (D C A) as a member in the year 2000 one of the branch in the mission field under the leadership of the missionaries. Having the passion for the things of God, I was baptized in the year 2002 that same I was discipled by the missionaries. As God may have it, I was called to pastor one of the branch under the ministry situated in Ogun Tedo Ogun State in the 2016. Since that year I have been the pastor and the current pastor of the branch."
}